xml/request/getsuppliers.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openpricecheck" xmlns:pric="http://biblstandard.dk/acq/serviceman/pricequery.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <open:getSuppliersRequest>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:getSuppliersRequest>
   </soapenv:Body>
</soapenv:Envelope>
